# Generic Zone Create Sketch Based Method

Source: https://www.revitapidocs.com/2026/29d77d56-9e59-4d7b-7804-7bb1df60e111.htm

---

| Generic Zone Create Sketch Based Method |
| --- |

**Namespace:** Autodesk.Revit.DB.Analysis
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public static GenericZone CreateSketchBased(
	Document doc,
	ElementId typeId,
	string name,
	GenericZoneDomainData domainData,
	ElementId levelId,
	IList<CurveLoop> curveLoops
)
```

```
Public Shared Function CreateSketchBased (
	doc As Document,
	typeId As ElementId,
	name As String,
	domainData As GenericZoneDomainData,
	levelId As ElementId,
	curveLoops As IList(Of CurveLoop)
) As GenericZone
```

```
public:
static GenericZone^ CreateSketchBased(
	Document^ doc,
	ElementId^ typeId,
	String^ name,
	GenericZoneDomainData^ domainData,
	ElementId^ levelId,
	IList<CurveLoop^>^ curveLoops
)
```

```
static member CreateSketchBased :
        doc : Document *
        typeId : ElementId *
        name : string *
        domainData : GenericZoneDomainData *
        levelId : ElementId *
        curveLoops : IList<CurveLoop> -> GenericZone
```

#### Parameters

doc Document
typeId ElementId
name String
domainData GenericZoneDomainData
levelId ElementId
curveLoops IList CurveLoop

#### Return Value

GenericZone See Also

#### Reference

GenericZone Class Autodesk.Revit.DB.Analysis Namespace